Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType
An enumerated type containing possible requests for the Path of Travel calculation.
Since:
2020
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType.CalculateShortestPathsToMultipleDestinations
Calculate paths from given start points to the closest of given destinations.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType.SetDistanceMapModeInView
Sets distance map mode in the view.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType.GetDistanceMapModeInView
Determine if distance map mode is on or off in the view.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType.CalculateForPathsWithWaypoints
Calculate paths of travel between corresponding pairs of start and end points with possible intermediate waypoints.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType.UnlockCache
Allow changes to internal caches

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType.LockCache
Lock changes to internal caches

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType.SetRevealObstaclesModeInView
Sets reveal obstacles mode in the view.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType.GetRevealObstaclesModeInView
Determine if reveal obstacles mode is on or off in the view.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType.CalculateFarthestPointsToMultipleDestinations
Calculate points with farthest distance to the closest of given destinations.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType.CalculateForAllPossibleStartEndPairs
Calculate paths of travel between all possible pairs of start and end points.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationRequestType.CalculateForCorrespondingStartEndPairs
Calculate paths of travel between corresponding pairs of start and end points.